# Profile1FlippedHor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..Profile1FlippedHor Property
ParameterTypeId Class See Also
---
"Profile Is Flipped"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Profile1FlippedHor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Profile1FlippedHor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Profile1FlippedHor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace